app/Filament/Resources/TagResource/Pages/ListTags.php

    public function getTabs(): array
    {
        /** @var Tab[] $tagTypes */
        $tagTypes = TagType::query()->get()
            ->mapWithKeys(fn (TagType $tagType): array => [
                $tagType->slug => Tab::make($tagType->name)
                    ->modifyQueryUsing(fn (Builder $query) => $query->where('tag_type_id', $tagType->id))
                    ->badge(Tag::query()->where('tag_type_id', $tagType->id)->count()),
            ])
            ->toArray();

        return [
            'all' => Tab::make()->badge(Tag::query()->count()),
            ...$tagTypes,
        ];
---
select count(*) as aggregate from "tags" where "tag_type_id" = 1
select * from "tag_types"
select count(*) as aggregate from "tags"