app/Filament/Resources/ItemResource/Pages/ListItems.php

select count(*) as aggregate from "items" where "item_type_id" is null
---
    public function getTabs(): array
    {
        /** @var Tab[] $itemTypes */
        $itemTypes = ItemType::query()->get()
            ->mapWithKeys(fn (ItemType $itemType): array => [
                $itemType->name => Tab::make($itemType->name)
                    ->modifyQueryUsing(fn (Builder $query) => $query->where('item_type_id', $itemType->id))
                    ->badge(Item::query()->where('item_type_id', $itemType->id)->count()),
            ])
            ->toArray();

        return [
            'all' => Tab::make()->badge(Item::query()->count()),
            ...$itemTypes,
            'none' => Tab::make('No Type')
                ->modifyQueryUsing(fn (Builder $query) => $query->whereNull('item_type_id'))
                ->badge(Item::query()->whereNull('item_type_id')->count()),