app/Http/Controllers/Photos/PhotosController.php

    public function show(
        Photo $photo,
        GetTagsAndItemsAction $getTagsAndItemsAction,
        GetNextPhotoAction $getNextPhotoAction,
        GetPreviousPhotoAction $getPreviousPhotoAction,
        GetRelevantTagShortcutAction $getRelevantTagShortcutAction,
    ): Response|JsonResponse {
        /** @var User $user */
        $user = auth()->user();

        if ($user->id !== $photo->user_id) {
            abort(404);
        }

        if (! request()->wantsJson()) {
            $tagsAndItems = $getTagsAndItemsAction->run();

            return Inertia::render('Photos/Show', [
                'photoId' => $photo->id,
                'items' => $tagsAndItems['items'],
                'tags' => $tagsAndItems['tags'],
                'nextPhotoUrl' => $getNextPhotoAction->run($user, $photo),
                'previousPhotoUrl' => $getPreviousPhotoAction->run($user, $photo),
                'tagShortcuts' => $this->getTagShortcuts($user),
            ]);
        }

        $photo
            ->append('full_path')
            ->load([
                'photoItems' => fn (Builder $q) => $q
                    ->with('item:id,name')
                    ->with('tags:id,name')
                    ->orderByDesc('id'),
                'photoItemSuggestions.item:id,name',
            ]);
---
select "id", "name" from "items" where "items"."id" in (1)
select * from "photo_item_suggestions" where "photo_item_suggestions"."photo_id" in (63)
select * from "photo_items" where "photo_items"."photo_id" in (63) order by "id" desc

    public function getTagShortcuts(User $user): Collection
    {
        return $user
            ->tagShortcuts()
            ->whereHas('tagShortcutItems')
            ->with(TagShortcut::commonEagerLoads())
            ->orderBy('shortcut')
            ->get();
---
select * from "tag_shortcuts" where "tag_shortcuts"."user_id" = 2 and "tag_shortcuts"."user_id" is not null and exists (select * from "tag_shortcut_items" where "tag_shortcuts"."id" = "tag_shortcut_items"."tag_shortcut_id") order by "shortcut" asc