app/Http/Controllers/Photos/PhotoItemTagsController.php

    public function store(PhotoItem $photoItem, StorePhotoItemTagRequest $request): JsonResponse
    {
        $this->authorize('manage', $photoItem->photo);

        $photoItem->tags()->syncWithoutDetaching((array) $request->input('tag_ids'));
---
insert into "photo_item_tag" ("tag_id", "photo_item_id", "created_at", "updated_at") values (1648, 6, '2026-03-20 08:03:01', '2026-03-20 08:03:01')