app/Http/Controllers/Photos/PhotoItemsController.php

    public function store(Photo $photo, StorePhotoItemRequest $request): JsonResponse
    {
        /** @var User $user */
        $user = auth()->user();

        if ($user->id !== $photo->user_id) {
            abort(404);
        }

        DB::transaction(function () use ($user, $photo, $request): void {
            $photo->items()->attach($request->item_ids, [
                'picked_up' => $user->settings->picked_up_by_default,
                'recycled' => $user->settings->recycled_by_default,
                'deposit' => $user->settings->deposit_by_default,
            ]);

            if ($request->suggestion_id) {
                $suggestion = $photo->photoSuggestions()
                    ->where('id', $request->suggestion_id)
                    ->first();
---
insert into "photo_items" ("item_id", "photo_id", "created_at", "updated_at", "picked_up", "recycled", "deposit") values (1, 63, '2026-03-20 08:02:44', '2026-03-20 08:02:44', 1, 0, 0)
select * from "photos" where "photos"."id" = 63 limit 1