app/Http/Controllers/LitterBotController.php

    public function suggest(Photo $photo, ClassifiesPhoto $action): JsonResponse
    {
        if ($photo->user_id !== auth()->id()) {
            abort(404);
        }

        $prediction = $action->run($photo);

        if (! $prediction instanceof PhotoItemPrediction) {
            return response()->json([
                'error' => 'Failed to connect to LitterBot service',
            ], 422);
        }

        $item = $this->findItem($prediction);

        if (! $item instanceof Item || $photo->items()->where('item_id', $item->id)->exists()) {
            return response()->json();
        }

        $suggestion = $photo->photoItemSuggestions()->create([
            'item_id' => $item->id,
            'score' => $prediction->score,
        ]);

        return response()->json($suggestion->load('item'));
---
select * from "photo_item_suggestions" where "photo_item_suggestions"."photo_id" = 13 and "photo_item_suggestions"."photo_id" is not null limit 1