app/Http/Controllers/ShareController.php

select * from "photo_items" where "photo_items"."photo_id" in (13)
select * from "photos" where "share_token" = 'ac42004a-3431-4d17-8b7f-ec31817ec95e' limit 1
select * from "users" where "users"."id" in (2)
---
    public function show(string $token): Response
    {
        $photo = Photo::query()
            ->with(['user:id,name,profile_photo_path', 'photoItems.item', 'photoItems.tags'])
            ->where('share_token', $token)
            ->firstOrFail();