app/Actions/Photos/ClassifyPhotoAction.php

    private function getLitterBotUrl(): string
    {
        $valueFromSettings = cache()->remember(
            self::LITTERBOT_URL_CACHE_KEY,
            now()->addSeconds(10),
            fn () => AppSetting::query()->where('key', 'litterbot_url')->value('value')
        );
---
select "value" from "app_settings" where "key" = 'litterbot_url' limit 1