app/Actions/Photos/FilterPhotosAction.php

select count(*) as aggregate from "photos" where "photos"."user_id" = 2 and "photos"."user_id" is not null
---
    public function run(User $user): LengthAwarePaginator
    {
        $photos = $user
            ->photos()
            ->filter($user->settings->photo_filters)
            ->withExists('items')
            ->orderBy($user->settings->sort_column, $user->settings->sort_direction);

        if ($user->settings->sort_column !== 'id') {
            $photos->orderBy('id');
        }

        $photos = $photos
            ->paginate($user->settings->getValidPerPage())
            ->withQueryString();