app/Actions/Photos/GetPreviousPhotoAction.php

    public function run(User $user, Photo $photo): ?string
    {
        $attribute = $photo->getAttribute($user->settings->sort_column);

        $filters = $user->settings->photo_filters;
        $userIds = $filters !== null ? $filters->user_ids : [];

        /** @var \Illuminate\Database\Eloquent\Builder<Photo> $builder */
        $builder = $user->is_admin && $userIds !== []
            ? Photo::query()->whereIn('user_id', $userIds)
            : $user->photos();

        $builder->filter($filters);

        if ($attribute) {
            $previousPhoto = $builder->clone()
                ->where($user->settings->sort_column, $user->settings->sort_direction === 'desc' ? '>' : '<', $attribute)
                ->orderBy($user->settings->sort_column, $user->settings->sort_direction === 'desc' ? 'asc' : 'desc')
                ->when($user->settings->sort_column !== 'id', fn (Builder $query) => $query->orderBy('id', 'desc'))
                ->first();
---
select * from "photos" where "photos"."user_id" = 2 and "photos"."user_id" is not null and "id" > 13 order by "id" asc limit 1