app/Actions/Photos/GetTagsAndItemsAction.php

select * from "tag_types"
select "id", "name", "tag_type_id" from "tags" order by "name" asc
select "id", "name" from "items" order by "name" asc
---
    public function run(): array
    {
        $tagTypes = TagType::query()->get();

        $tags = Tag::toBase()
            ->select(['id', 'name', 'tag_type_id'])
            ->orderBy('name')
            ->get()
            ->groupBy('tag_type_id')
            ->mapWithKeys(function (Collection $values, int $key) use ($tagTypes): array {
                /** @var TagType $tagType */
                $tagType = $tagTypes->find($key);

                return [$tagType->slug => $values];
            });

        return [
            'tags' => $tags,
            'items' => Item::toBase()->select(['id', 'name'])->orderBy('name')->get(),