app/Filament/Pages/ReplaceItems.php

select count(*) as aggregate from "photo_items" where "item_id" = '2'
select "items".*, (select count(*) from "photo_items" where "items"."id" = "photo_items"."item_id") as "photo_items_count" from "items"
select "name", "id" from "items"
---
    protected function getItemOptions(): array
    {
        return Item::query()
            ->withCount('photoItems')
            ->get()
            ->mapWithKeys(fn (Item $item): array => [
                $item->id => "{$item->name} ({$item->photo_items_count}x)",
            ])
            ->toArray();

select * from "items" where "items"."id" = '2' limit 1
select * from "items" where "items"."id" = '4' limit 1
update "photo_items" set "item_id" = 4 where "item_id" = 2
---
    public function replace(): void
    {
        /** @var array{fromItemId: int, toItemId: int} $data */
        $data = $this->form->getState();

        /** @var Item $fromItem */
        $fromItem = Item::findOrFail($data['fromItemId']);
        /** @var Item $toItem */
        $toItem = Item::findOrFail($data['toItemId']);

        $affectedRows = DB::table('photo_items')
            ->where('item_id', $fromItem->id)
            ->update(['item_id' => $toItem->id]);