app/Filament/Pages/ReplaceItems.php

select * from "items" where "items"."id" = '3' limit 1
---
    public function replace(): void
    {
        /** @var array{fromItemId: int, toItemId: int} $data */
        $data = $this->form->getState();

        if ($data['fromItemId'] === $data['toItemId']) {
            Notification::make()
                ->title('Same item selected')
                ->body('The item to replace and the replacement item cannot be the same.')
                ->danger()
                ->send();

            return;
        }

        /** @var Item $fromItem */
        $fromItem = Item::findOrFail($data['fromItemId']);